app/controllers/donations_controller.rb

SELECT "donations".* FROM "donations"
---
  def index
    @donations = Donation.all

SELECT  "donations".* FROM "donations" WHERE "donations"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_donation
      @donation = Donation.find(params[:id])